# -*- coding: utf-8-*-
def default_sentence():
    return '''1번. 정보통신 3요소
2번. 프로토콜 이란?
3번. 순서지정 설명
4번. MTU(맥시멈 트렌스포 유닛)이란?
5번. 단편화/재조합 단위는?
6번. 프로토콜 특징 (1)
7번. OSI 7 Layer를 한문장으로하면?
8번. 네트워크 크기는?
9번. OSI 1 계층 (간단설명)
10번. OSI 2 계층 (간단설명)
11번. OSI 3 계층 (간단설명)
12번. OSI 4 계층 (간단설명)
13번. 웹서버, WAS차이
14번. 세션관련 공격은?
15번. OSI 5,6,7 계층(간단설명)
16번. TCP/IP 계층 전반적인 설명
17번. 위는 MAC주소 기반 통신기술은?
18번. IP주소 특징
19번. 라우터 특징.
20번. 사설망
21번. 공인망
22번. NAT
23번. 인터넷할때 IP설정시 4가지 알아야함
24번. DHCP 설정할때 알려줘야할 4가지(23번과 연계)
25번. ★ARP
26번. ICMP (ping이라는 프로그램이 데이터를 주고받을 때 사용하는것)
27번. TCP/UDP 차이 및  통신특징
28번. 네트워크에서 스캐닝이란?
29번. ARP 스푸핑
30번. 하트블리드
31번. 스머프 공격
32번. NTP 프로토콜
33번. DNS DrDoS
34번. ★ tip! : UDP는 요청하면 바로 대답해주기 때문에 DrDoS에 주로 사용한다.
35번. Slowloris DoS
36번. 1. 무선 취약점
37번. 무선 DoS가 왜 위험한가?
38번. WEP Crack원리(Open Auth)
39번. WPA Crack 원리
40번. <컨설턴트 살아남기>
41번. <메일 사용법>
42번. <보고서 팁>
43번. <발표 연습>
44번. 
'''
'''

시나리오
툴
산출물 : 수행계획서 - 결과보고서






'''
