# -*- coding:utf-8 -*-
# ""__main__""
# print u"안녕하세요 제 이름은 추다영 (이)고 나이는 20 살입니다. 반갑습니다."
# print u"안녕하세요 제 이름은 신상원 (이)고 나이는 20 살입니다. 반갑습니다."
# print u"안녕하세요 제 이름은 배형준 (이)고 나이는 20 살입니다. 반갑습니다."
# print u"안녕하세요 제 이름은 조영준 (이)고 나이는 20 살입니다. 반갑습니다."
# print u"안녕하세요 제 이름은 박지영 (이)고 나이는 20 살입니다. 반갑습니다."
# print u"안녕하세요 제 이름은 여서래 (이)고 나이는 20 살입니다. 반갑습니다."
# print u"안녕하세요 제 이름은 유슬기 (이)고 나이는 20 살입니다. 반갑습니다."
# print u"안녕하세요 제 이름은 정지수 (이)고 나이는 20 살입니다. 반갑습니다."

# def intro(v):
#     print u"안녕하세요 제 이름은", v, u"(이)고 나이는 20 살입니다. 반갑습니다."
    

# print "Start"
# intro(u"주다영")


#세전 가격을 입력받고, 세후 가격을 반환하는 함수  (세금은 10%)
# def cir(x):
#    after = x * 1.10
#    return after
    
# print cir(100)
# print cir(1000)
    
if __name__ == "__main__": 
    n = int(input())
i=1
for i in range(0,n):
    print('*')


